#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_lightsail_static_ip.amplifica: Refreshing state... [id=amplifica]
aws_ssm_document.cloud_init_wait: Refreshing state... [id=cloud-init-wait]
aws_lightsail_instance.amplifica: Refreshing state... [id=amplifica_server]
cloudflare_record.amplifica: Refreshing state... [id=ad60a43465cd244eafc054a81299b3b1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lightsail_instance.amplifica has changed
  ~ resource "aws_lightsail_instance" "amplifica" {
      ~ arn                = "arn:aws:lightsail:us-east-2:762560579492:Instance/bbdde2ad-8774-4cec-87f8-801db82a0a39" -> "arn:aws:lightsail:us-east-2:762560579492:Instance/8d4e1e3f-259f-4998-b8d6-002c7ae3316d"
      ~ created_at         = "2022-02-02T02:33:10Z" -> "2022-02-02T03:52:02Z"
        id                 = "amplifica_server"
      ~ ipv6_address       = "2600:1f16:9c6:bb00:1602:e6e3:69b9:b329" -> "2600:1f16:9c6:bb00:cac5:30dc:9aec:df3e"
      ~ ipv6_addresses     = [
          - "2600:1f16:9c6:bb00:1602:e6e3:69b9:b329",
          + "2600:1f16:9c6:bb00:cac5:30dc:9aec:df3e",
        ]
        name               = "amplifica_server"
      ~ private_ip_address = "172.26.15.98" -> "172.26.12.213"
      ~ public_ip_address  = "18.219.215.27" -> "3.128.172.126"
        tags               = {
            "project" = "amplifica"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_document.cloud_init_wait has been deleted
  - resource "aws_ssm_document" "cloud_init_wait" {
      - arn              = "arn:aws:ssm:us-east-2:762560579492:document/cloud-init-wait" -> null
      - content          = <<-EOT
            schemaVersion: '2.2'
            description: Wait for cloud init to finish
            mainSteps:
            - action: aws:runShellScript
              name: StopOnLinux
              precondition:
                StringEquals:
                - platformType
                - Linux
              inputs:
                runCommand:
                - cloud-init status --wait
        EOT -> null
      - created_date     = "2022-02-02T01:39:57Z" -> null
      - default_version  = "1" -> null
      - description      = "Wait for cloud init to finish" -> null
      - document_format  = "YAML" -> null
      - document_type    = "Command" -> null
      - document_version = "1" -> null
      - hash             = "21017181189f5fcbd42d9c0439d797338c7baa704a89aff3c8e2361e7eaa9d14" -> null
      - hash_type        = "Sha256" -> null
      - id               = "cloud-init-wait" -> null
      - latest_version   = "1" -> null
      - name             = "cloud-init-wait" -> null
      - owner            = "762560579492" -> null
      - parameter        = [] -> null
      - permissions      = {} -> null
      - platform_types   = [
          - "Linux",
        ] -> null
      - schema_version   = "2.2" -> null
      - status           = "Active" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lightsail_instance.amplifica is tainted, so must be replaced
-/+ resource "aws_lightsail_instance" "amplifica" {
      ~ arn                = "arn:aws:lightsail:us-east-2:762560579492:Instance/8d4e1e3f-259f-4998-b8d6-002c7ae3316d" -> (known after apply)
      ~ cpu_count          = 1 -> (known after apply)
      ~ created_at         = "2022-02-02T03:52:02Z" -> (known after apply)
      ~ id                 = "amplifica_server" -> (known after apply)
      ~ ipv6_address       = "2600:1f16:9c6:bb00:cac5:30dc:9aec:df3e" -> (known after apply)
      ~ ipv6_addresses     = [
          - "2600:1f16:9c6:bb00:cac5:30dc:9aec:df3e",
        ] -> (known after apply)
      ~ is_static_ip       = false -> (known after apply)
      - key_pair_name      = "LightsailDefaultKeyPair" -> null
        name               = "amplifica_server"
      ~ private_ip_address = "172.26.12.213" -> (known after apply)
      ~ public_ip_address  = "3.128.172.126" -> (known after apply)
      ~ ram_size           = 1 -> (known after apply)
        tags               = {
            "project" = "amplifica"
        }
      ~ username           = "ubuntu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_lightsail_instance_public_ports.amplifica will be created
  + resource "aws_lightsail_instance_public_ports" "amplifica" {
      + id            = (known after apply)
      + instance_name = "amplifica_server"

      + port_info {
          + cidrs     = (known after apply)
          + from_port = 22
          + protocol  = "tcp"
          + to_port   = 22
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 3838
          + protocol  = "tcp"
          + to_port   = 3838
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 443
          + protocol  = "tcp"
          + to_port   = 443
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 8787
          + protocol  = "tcp"
          + to_port   = 8787
        }
    }

  # aws_lightsail_static_ip_attachment.amplifica will be created
  + resource "aws_lightsail_static_ip_attachment" "amplifica" {
      + id             = (known after apply)
      + instance_name  = (known after apply)
      + ip_address     = (known after apply)
      + static_ip_name = "amplifica"
    }

  # aws_ssm_document.cloud_init_wait will be created
  + resource "aws_ssm_document" "cloud_init_wait" {
      + arn              = (known after apply)
      + content          = <<-EOT
            schemaVersion: '2.2'
            description: Wait for cloud init to finish
            mainSteps:
            - action: aws:runShellScript
              name: StopOnLinux
              precondition:
                StringEquals:
                - platformType
                - Linux
              inputs:
                runCommand:
                - cloud-init status --wait
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "cloud-init-wait"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @diraol, Action: `pull_request`*